In [1]:
import pandas as pd
import os

In [2]:
df = pd.read_csv(os.path.join('example'))

In [3]:
df.to_csv('my_output', index = False)

In [4]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [6]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [7]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [12]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","October 25, 2019"
1,"Louisa Community Bank, Inc.",Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","October 25, 2019"
2,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
3,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
4,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"

building temporary sql engine is needed to read SQl

In [13]:
from sqlalchemy import create_engine

In [15]:
engine = create_engine('sqlite:///:memory:')

In [17]:
df.to_sql('my_table', engine)

In [19]:
sqldf = pd.read_sql('my_table', con=engine)

In [20]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15